app/controllers/matches_controller.rb

  def index
    render json: Match.all
---
SELECT "matches".* FROM "matches"

  def show
    render json: Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    render json: Match.create(req_params).to_json
---
INSERT INTO "matches" ("challenger", "challengee", "challengerOutcome", "status") VALUES ($1, $2, $3, $4) RETURNING "id"  [["challenger", 23], ["challengee", 242], ["challengerOutcome", true], ["status", 0]]