app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
      render json:  User.all.to_json

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    render json: User.find(params[:id]).to_json

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "cherry"], ["email", "cherry"], ["password_digest", "cherry@cherry.com"], ["created_at", "2018-06-02 16:48:01.881074"], ["updated_at", "2018-06-02 16:48:01.881074"]]
---
  def create
    render json: User.create(req_params).to_json